/* Rexx Exec to pull upstream master */
say '-----------------------------------------------------------------------------'
/*'cd /Users/frankfella/workspace/FrankFella-java'*/
'git status && git pull upstream master'  
say '-----------------------------------------------------------------------------'
 